c5/src/Catalogs/Metadata/Metadata.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Metadata</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>AccountingRegisters</name>
      <description>Accounting registers</description>
    </items>
    <items>
      <name>AccumulationRegisters</name>
      <description>Accumulation registers</description>
    </items>
    <items>
      <name>BusinessProcesses</name>
      <description>Business processes</description>
    </items>
    <items>
      <name>CalculationRegisters</name>
      <description>Calculation registers</description>
    </items>
    <items>
      <name>Catalogs</name>
      <description>Catalogs</description>
    </items>
    <items>
      <name>ChartsOfAccounts</name>
      <description>Charts of accounts</description>
    </items>
    <items>
      <name>ChartsOfCalculationTypes</name>
      <description>Charts of calculation types</description>
    </items>
    <items>
      <name>ChartsOfCharacteristicTypes</name>
      <description>Charts of feature types</description>
    </items>
    <items>
      <name>DataProcessors</name>
      <description>Data processors</description>
    </items>
    <items>
      <name>DocumentJournals</name>
      <description>Document journals</description>
    </items>
    <items>
      <name>Documents</name>
      <description>Documents</description>
    </items>
    <items>
      <name>Enums</name>
      <description>Enums</description>
    </items>
    <items>
      <name>ExchangePlans</name>
      <description>Exchange plans</description>
    </items>
    <items>
      <name>InformationRegisters</name>
      <description>Information registers</description>
    </items>
    <items>
      <name>Reports</name>
      <description>Reports</description>
    </items>
    <items>
      <name>Subsystems</name>
      <description>Subsystems</description>
    </items>
    <items>
      <name>Tasks</name>
      <description>Tasks</description>
    </items>
  </predefined>
  <attributes>
    <name>ExplanationEN</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ExplanationRO</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ExplanationRU</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>NotFound</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Path</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SynonymEN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SynonymRO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SynonymRU</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

c5/src/Catalogs/Metadata/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

#if ( Server ) then

Function Ref ( Path, Renew = false ) export

	SetPrivilegedMode ( true );
	item = FindByAttribute ( "Path", Path );
	if ( item.IsEmpty () or Renew ) then
		if ( item.IsEmpty () ) then
			obj = CreateItem ();
			isNew = true;
		else
			obj = item.GetObject ();
			isNew = false;
		endif; 
		init ( Path, obj, isNew );
		obj.Write ();
		item = obj.Ref;
	endif; 
	return item;
	
EndFunction

Procedure init ( Path, Object, IsNew )
	
	item = Metadata.FindByFullName ( Path );
	lang = CurrentLanguage ();
	languages = Metadata.Languages;
	isEnglish = ( lang = languages.Find ( "English" ) );
	isRomanian = ( lang = languages.Find ( "Romanian" ) );
	if ( IsNew or isEnglish ) then
		Object.Description = item.Presentation ();
	endif; 
	Object.Parent = getParent ( Path );
	Object.Path = Path;
	if ( isEnglish ) then
		Object.ExplanationEN = item.Explanation;
		Object.SynonymEN = item.Synonym;
	elsif ( isRomanian ) then
		Object.ExplanationRO = item.Explanation;
		Object.SynonymRO = item.Synonym;
	else
		Object.ExplanationRU = item.Explanation;
		Object.SynonymRU = item.Synonym;
	endif; 
	Object.NotFound = false;
	
EndProcedure

Function getParent ( Path )
	
	class = Left ( Path, Find ( Path, "." ) - 1 );
	if ( class = "Catalog" ) then
		parent = Catalogs;
	elsif ( class = "AccountingRegister" ) then
		parent = AccountingRegisters;
	elsif ( class = "AccumulationRegister" ) then
		parent = AccumulationRegisters;
	elsif ( class = "BusinessProcess" ) then
		parent = BusinessProcesses;
	elsif ( class = "CalculationRegister" ) then
		parent = CalculationRegisters;
	elsif ( class = "ChartOfAccounts" ) then
		parent = ChartsOfAccounts;
	elsif ( class = "ChartsOfCalculationType" ) then
		parent = ChartsOfCalculationTypes;
	elsif ( class = "ChartOfCharacteristicTypes" ) then
		parent = ChartsOfCharacteristicTypes;
	elsif ( class = "DataProcessor" ) then
		parent = DataProcessors;
	elsif ( class = "Document" ) then
		parent = Documents;
	elsif ( class = "DocumentJournal" ) then
		parent = DocumentJournals;
	elsif ( class = "InformationRegister" ) then
		parent = InformationRegisters;
	elsif ( class = "Report" ) then
		parent = Reports;
	elsif ( class = "Task" ) then
		parent = Tasks;
	elsif ( class = "Enum" ) then
		parent = Enums;
	elsif ( class = "Subsystem" ) then
		parent = Subsystems;
	elsif ( class = "ExchangePlan" ) then
		parent = ExchangePlans;
	else
		parent = EmptyRef ();
	endif; 
	return parent;

EndFunction

#endif

#endif
